fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиентов/ВКМ_ОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиентов</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>ВКМ_Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяОконачнияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ВыполненныеРаботы</name>
    <attributes>
      <name>ВКМ_ОписаниеРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>ВКМ_КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиентов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//Начало кода для проверки типа договора и даты документа в периоде (ВКМ_диплом)
	
	НачПериод = ВКМ_Договор.ВКМ_НачПериод;
    КонПериод = ВКМ_Договор.ВКМ_КонПериод;
    Если ВКМ_Договор.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выберите правильный договор, Абонентское обслуживание.";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли; 
	Если  НачПериод < Дата и  Дата > ВКМ_Договор.ВКМ_КонПериод  Тогда  
	    Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не правильная дата документа.";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли; 
		
	//Конец кода проверки типа договора и даты документа в периоде (ВКМ_диплом)
	
	//Начало кода  заполнения регистра накопления (ВКМ_диплом)  
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	Движение.ВидДвижения  =  ВидДвиженияНакопления.Приход;
    Движение.Период = Дата;
	Движение.ВКМ_Договор = ВКМ_Договор;
	Движение.ВКМ_Клиент = ВКМ_Клиент;
	
	Для Каждого ТекСтрокаВКМ_ВыполненныеРаботы из ВКМ_ВыполненныеРаботы Цикл
		
		Движение.ВКМ_КоличествоЧасов = ТекСтрокаВКМ_ВыполненныеРаботы.ВКМ_ФактическиПотраченоЧасов;
		Движение.ВКМ_СуммаКОплате = ТекСтрокаВКМ_ВыполненныеРаботы.ВКМ_ЧасыКОплатеКлиенту;
	КонецЦикла;	
	// Конец кода заполнения регистра накопления (ВКМ_диплом)

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	// Начало кода для проверки вновь созданного документа в базе 1с (ВКМ_диплом)
	Если ОбменДанными.Загрузка Тогда
     Возврат;
    КонецЕсли;
	Если ДополнительныеСвойства.Свойство("ЭтоНовыйОбъект", Истина) Тогда
		НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		НовыйЭлемент.ТекстСообщения = "Создано новое задание с номером " + ЭтотОбъект.Ссылка.Номер + " и датой " +
		ЭтотОбъект.Ссылка.Дата;
		НовыйЭлемент.Записать();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = " Создано уведомление для телеграм-бота";
		Сообщение.Сообщить(); 		
    КонецЕсли;
		// Конец кода для проверки вновь созданного документа в базе 1с (ВКМ_диплом)	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Начало кода для присваивания истиности нового документа (ВКМ_диплом)
	Если ОбменДанными.Загрузка Тогда
     Возврат;
    КонецЕсли;
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда	
		ДополнительныеСвойства.Вставить("ЭтоНовыйОбъект", Истина);	
	КонецЕсли; 
	// Конец окда для присваивания истиности нового документа (ВКМ_диплом)
КонецПроцедуры
#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
